/* 香港繁體中文本地化 for AIA（試點：帳單/待辦） */

// MARK: - 通用
"common.delete" = "刪除";
"common.other" = "其他";
"common.cancel" = "取消";
"common.confirmDelete" = "確認刪除";
"common.deleteCount" = "刪除 %d 條記錄？";
"common.selectAll" = "全選";
"common.deselectAll" = "取消全選";
"common.delete" = "刪除";
"common.none" = "—";
"common.save" = "儲存";
"common.cancel" = "取消";
"common.ok" = "好";
"common.send" = "發送";
"chat.feedback" = "意見反饋";
"chat.action.camera" = "拍照";
"chat.action.album" = "相簿";
"chat.action.file" = "檔案";
"feedback.placeholder" = "請描述您遇到的問題或建議…";
"feedback.mailUnavailableTitle" = "無法發送郵件";
"feedback.mailUnavailableMessage" = "您的裝置未配置郵件帳戶。請將反饋發送至 %@，或點擊「複製郵箱」。";
"feedback.copyEmail" = "複製郵箱";

// MARK: - 導覽標題
"tab.bill" = "帳單管理";
"tab.todo" = "待辦提醒";

// MARK: - 帳單模組 (BillListView)
"bill.today" = "今日帳單";
"bill.thisMonth" = "本月帳單";
"bill.thisWeek" = "本週帳單";
"bill.thisYear" = "本年帳單";
"bill.noRecords" = "暫無記錄";
"food.week.empty" = "暫無記錄，可使用語音、文字、照片記錄";
"bill.week.empty" = "暫無記錄，可使用語音、文字、截圖、導入記帳";
"bill.week.empty" = "暫無記錄，可使用語音、文字、截圖、導入記帳";
"bill.budget" = "預算";
"bill.last7days" = "近 7 日消費";
"bill.monthlyBudget" = "本月預算 ¥%d";
"bill.budgetUsed" = "已用 %d%%";
"bill.filter.all" = "全部";
"bill.filter.month" = "按月查看";
"bill.filter.calendar" = "在日曆查看";
"bill.monthly.income" = "收入";
"bill.monthly.expense" = "支出";
"bill.monthly.balance" = "結餘";
"bill.details" = "帳單詳情";
"bill.searchMerchant" = "搜尋商戶、金額、分類、日期、備註";
"bill.searchEmpty" = "未找到匹配“%@”的帳單";
"bill.carousel.hint" = "點擊圓環查看詳情 / 左右滑動查看更多";
"bill.empty.title" = "沒有%@帳單記錄";
"bill.empty.desc" = "截一張付款 / 消費截圖";
"bill.calendar.selectedDateTitle" = "%@ 的帳單";
"bill.calendar.noBills" = "該日暫無帳單";
"bill.calendar.expenseTotal" = "支出 ¥%.2f";
"bill.calendar.incomeTotal" = "收入 ¥%.2f";
"bill.status.confirmed" = "已確認";
"bill.status.pending" = "待確認";
"bill.category.food" = "餐飲";
"bill.category.transport" = "交通";
"bill.category.shopping" = "購物";
"bill.custom.startDate" = "開始日期";
"bill.custom.endDate" = "結束日期";

// MARK: - 待辦模組 (ReminderListView)
"todo.title" = "待辦提醒";
"todo.suggestion.title" = "智能建議";
"todo.suggestion.desc" = "截圖已識別，建議創建待辦";
"todo.suggestion.add" = "加入";
"todo.filter.active" = "待辦提醒 %d";
"todo.filter.finished" = "已完成 %d";
"todo.filter.calendar" = "日曆展示";
"todo.empty.title" = "沒有%@待辦";
"todo.empty.desc" = "截一張待辦 / 日程截圖";
"todo.calendar.weekday.sun" = "日";
"todo.calendar.weekday.mon" = "一";
"todo.calendar.weekday.tue" = "二";
"todo.calendar.weekday.wed" = "三";
"todo.calendar.weekday.thu" = "四";
"todo.calendar.weekday.fri" = "五";
"todo.calendar.weekday.sat" = "六";
"todo.calendar.noTasks" = "當天沒有待辦";
"todo.calendar.selectedDateTitle" = "%@ 待辦";
"todo.priority.high" = "高";
"todo.priority.medium" = "中";
"todo.priority.low" = "低";

// MARK: - 飲食模組 (FoodListView)
"food.navTitle" = "飲食記錄";
"food.today" = "今天 · %@ %@";
"food.netLabel" = "淨熱量 kcal";
"food.intakeTdee" = "攝入 %d · TDEE %d";
"food.belowGoal" = "低於目標，可加餐 🍎";
"food.overGoal" = "已超目標，注意控制";
"food.burned" = "今日消耗";
"food.tdeeLabel" = "TDEE kcal";
"food.water" = "今日飲水";
"food.waterUnit" = "ml";
"food.waterTapHint" = "點擊 +100ml";
"food.nutrition" = "營養構成";
"food.nutritionTarget" = "建議 碳水%d / 蛋白%d / 脂肪%d g";
"home.diet.calorieSuggestion" = "熱量建議";
"food.macro.protein" = "蛋白質";
"food.macro.carb" = "碳水";
"food.macro.fat" = "脂肪";
"food.macro.fiber" = "膳食纖維";
"food.macro.sugar" = "糖";
"food.macro.sodium" = "鈉";
"food.last7days" = "近 7 日熱量攝入";
"week.current" = "本週";
"food.empty.title" = "還沒有%@記錄";
"food.empty.desc" = "點底部相機拍照識別";
"food.recognized" = "識別";
"food.by_chat" = "對話";
"food.meal.breakfast" = "早餐";
"food.meal.lunch" = "午餐";
"food.meal.dinner" = "晚餐";
"food.meal.snack" = "加餐";

// MARK: - 健康模組 (HealthListView)
"health.navTitle" = "健康管理";
"health.ring.steps" = "步";
"health.ring.sleep" = "睡眠";
"health.ring.energy" = "TDEE";
"health.ring.exercise" = "運動";
"health.stat.weight" = "體重";
"health.stat.height" = "身高";
"health.stat.restingHR" = "靜息心率";
"health.stat.bmi" = "BMI";
"health.weightTrend" = "體重趨勢";
"health.noWeight" = "暫無體重記錄，去首頁截一張體重截圖";
"health.sleepStages" = "睡眠分期 · 昨晚";
"health.sleep.deep" = "深睡 %.1fh";
"health.sleep.deepSub" = "佔比 %d%%，良好";
"health.sleep.light" = "淺睡 %.1fh";
"health.sleep.rem" = "REM %.1fh";
"health.sleep.remSub" = "快速眼動";
"health.weekSteps" = "近 7 日步數";

// MARK: - 圖表座標軸共享
"chart.day" = "日";
"chart.kcal" = "kcal";
"chart.kg" = "kg";
"chart.step" = "步";

// MARK: - 健身目標 (BodyDataView / DietAnalysisView)
"fitness.goal.title" = "健身目標";
"fitness.goal.subtitle" = "用於飲食分析頁的熱量/蛋白建議";
"fitness.goal.cut" = "減脂";
"fitness.goal.bulk" = "增肌";
"fitness.goal.maintain" = "維持";
"diet.analysis.goalTarget" = "目標達成";
"diet.analysis.calorieTarget" = "目標熱量";
"diet.analysis.proteinTarget" = "蛋白推薦";
"diet.analysis.goalMet" = "達標";
"diet.analysis.goalLow" = "偏低";
"diet.analysis.goalOver" = "超出";
"diet.analysis.noWeight" = "請先在身體數據頁錄入體重";
